Revit 2027 API
BuiltInFailures.LooseDimensionFailures.LooseInsertsForCurtainWall Property
 Switching element type to Curtain element. All inserts in the element will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LooseInsertsForCurtainWall { get; }
Public Shared ReadOnly Property LooseInsertsForCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LooseInsertsForCurtainWall {
	FailureDefinitionId^ get ();
}
static member LooseInsertsForCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LooseDimensionFailures Class
Autodesk.Revit.DB Namespace